[
  "Why did the math book look sad? It had too many problems.",
  "Why don’t scientists trust atoms? Because they make up everything!",
  "Why can’t you give Elsa a balloon? Because she’ll let it go.",
  "What do you call cheese that isn’t yours? Nacho cheese!",
  "Why did the tomato blush? Because it saw the salad dressing.",
  "Why couldn’t the bicycle stand up by itself? It was two-tired.",
  "Why do cows have hooves instead of feet? Because they lactose.",
  "How does a penguin build its house? Igloos it together.",
  "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
  "What’s orange and sounds like a parrot? A carrot.",
  "What do you call a fake noodle? An impasta.",
  "Why don’t skeletons fight each other? They don’t have the guts.",
  "Why did the scarecrow win an award? Because he was outstanding in his field.",
  "What do you call a bear with no teeth? A gummy bear.",
  "Why did the cookie go to the doctor? Because it was feeling crumby.",
  "Why don’t oysters donate to charity? Because they’re shellfish.",
  "How do you organize a space party? You planet.",
  "What do you call an alligator in a vest? An investigator.",
  "Why did the bicycle fall over? Because it was two-tired.",
  "Why can’t your nose be 12 inches long? Because then it would be a foot.",
  "What did the grape do when it got stepped on? Nothing, but it let out a little wine.",
  "What do you call a boomerang that won’t come back? A stick.",
  "Why are elevator jokes so good? They work on many levels.",
  "Why do bees have sticky hair? Because they use honeycombs.",
  "What’s a skeleton’s least favorite room in the house? The living room.",
  "Why don’t eggs tell jokes? They’d crack each other up.",
  "Why did the computer go to the doctor? Because it caught a virus.",
  "Why did the music teacher go to jail? She got caught with the wrong notes.",
  "Why are frogs so happy? They eat whatever bugs them.",
  "What do you call a dog magician? A labracadabrador.",
  "Why did the gym close down? It just didn’t work out.",
  "What do you call a dinosaur with an extensive vocabulary? A thesaurus.",
  "What’s brown and sticky? A stick.",
  "Why did the scarecrow become a successful neurosurgeon? Because he had brains to spare.",
  "How does a vampire start a letter? Tomb it may concern.",
  "Why was the math teacher late to work? She took the rhombus.",
  "What’s the best way to watch a fly fishing tournament? Live stream.",
  "Why do we never tell secrets on a farm? Because the potatoes have eyes and the corn has ears.",
  "Why can’t leopards hide? They’re always spotted.",
  "Why don’t melons get married? Because they cantaloupe.",
  "Why did the frog take the bus to work today? His car got toad.",
  "What do you call a pile of cats? A meowtain.",
  "What kind of shoes do ninjas wear? Sneakers.",
  "Why don’t seagulls fly over the bay? Because then they’d be bagels.",
  "What kind of car does a sheep drive? A lamborghini.",
  "What did the janitor say when he jumped out of the closet? Supplies!",
  "Why don’t koalas count as bears? They don’t have the right koalafications.",
  "What do you call a snowman with a six-pack? An abdominal snowman.",
  "How do you make a tissue dance? Put a little boogie in it.",
  "Why did the cow cross the road? To get to the udder side.",
  "Why did the picture go to jail? Because it was framed.",
  "Why do bananas never get lonely? Because they hang out in bunches.",
  "What kind of tree fits in your hand? A palm tree.",
  "Why don’t ants get sick? Because they have tiny ant-bodies.",
  "What do you call a fish with no eyes? Fsh.",
  "What do you call a can opener that doesn’t work? A can’t opener.",
  "Why was the broom late to work? It swept in.",
  "Why did the chicken join a band? Because it had the drumsticks.",
  "Why did the scarecrow get promoted? He was outstanding in his field.",
  "Why don’t spiders use cell phones? They don’t want to get tangled in the web.",
  "Why don’t some couples go to the gym? Because some relationships don’t work out.",
  "Why did the golfer bring an extra pair of pants? In case he got a hole in one.",
  "Why do ghosts love elevators? It lifts their spirits.",
  "What do you call a factory that makes okay products? A satisfactory.",
  "Why do crabs never share? Because they’re shellfish.",
  "Why did the bicycle collapse? It was two-tired.",
  "What’s a pirate’s favorite letter? You’d think it’s R, but it’s really the C.",
  "Why was the calendar afraid? Its days were numbered.",
  "What did one wall say to the other wall? I’ll meet you at the corner.",
  "Why did the music note go to school? To learn how to compose itself.",
  "Why did the man get hit by a bike every day? He was stuck in a vicious cycle.",
  "What’s a snowman’s favorite drink? Iced tea.",
  "Why are ghosts bad liars? Because you can see right through them.",
  "Why did the tomato turn red? Because it saw the salad dressing.",
  "Why did the golfer bring a ladder? To reach the high scores.",
  "What’s the best time to go to the dentist? Tooth-hurty.",
  "Why did the computer keep freezing? It left its Windows open.",
  "What do you get when you cross a snowman with a vampire? Frostbite.",
  "Why don’t elephants use computers? They’re afraid of the mouse.",
  "What kind of music do mummies love? Wrap music.",
  "Why did the astronaut break up with his girlfriend? He needed space.",
  "Why are calendars so good at math? They’re good at counting days.",
  "What did the fisherman say to the magician? Pick a cod, any cod.",
  "What do you call a cow with no legs? Ground beef.",
  "Why do mushrooms get invited to all the parties? Because they’re such fungis.",
  "Why did the belt get arrested? It was holding up a pair of pants.",
  "Why was the stadium so cool? It was filled with fans.",
  "What kind of shoes do frogs wear? Open toad sandals.",
  "Why did the coffee file a police report? It got mugged.",
  "What do you call a sleeping bull? A bulldozer.",
  "Why don’t vampires like garlic? It gives them bad breath.",
  "What do you call a bee that can’t make up its mind? A maybee.",
  "Why did the hipster burn his mouth? He drank his coffee before it was cool.",
  "Why was the big cat disqualified from the race? Because it was a cheetah."
]
